src/test/resources/ADSobjmuudatused.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
  <SOAP-ENV:Header
    xmlns:xrd="http://x-road.eu/xsd/xroad.xsd"
    xmlns:id="http://x-road.eu/xsd/identifiers">
    <xrd:client id:objectType="MEMBER">
      <id:xRoadInstance>EE</id:xRoadInstance>
      <id:memberClass>BUSINESS</id:memberClass>
      <id:memberCode>10324057</id:memberCode>
      <id:subsystemCode />
    </xrd:client>
    <xrd:service id:objectType="SERVICE">
      <id:xRoadInstance>EE</id:xRoadInstance>
      <id:memberClass>GOV</id:memberClass>
      <id:memberCode>70003098</id:memberCode>
      <id:subsystemCode>ads</id:subsystemCode>
      <id:serviceCode>ADSobjmuudatused</id:serviceCode>
      <id:serviceVersion>v4</id:serviceVersion>
    </xrd:service>
    <xrd:userId>EE12345678901</xrd:userId>
    <xrd:id>4894e35d-bf0f-44a6-867a-8e51f1daa7e0</xrd:id>
    <xrd:protocolVersion>4.0</xrd:protocolVersion>
</SOAP-ENV:Header>
  <SOAP-ENV:Body>
    <ns1:ADSobjmuudatused xmlns:ns1="http://adsv5.x-road.ee/producer/">
          <logId>?</logId>
          <maxarv>?</maxarv>
          <hSyndmused>true</hSyndmused>
          <andmevektor>000</andmevektor>
          <aadressKomp>true</aadressKomp>
          <objJarglased>true</objJarglased>
          <probleemid>true</probleemid>
          <seotudObjektid>true</seotudObjektid>
    </ns1:ADSobjmuudatused>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>